In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

## Series

In [2]:
obj = Series([1, 2, 3, -4, -5])

In [3]:
obj

0    1
1    2
2    3
3   -4
4   -5
dtype: int64

* index를 따로 지정하지 않았으므로 자동으로 0부터 N-1까지 설정
* values, index 속성을 이용할 수 있다.

In [4]:
obj.values

array([ 1,  2,  3, -4, -5], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

* index를 지정해 Series 객체를 생성할 수 있다.

In [6]:
obj2 = Series([1, 2, -3, -4], index=['a', 'b', 'c', 'd'])

In [7]:
obj2

a    1
b    2
c   -3
d   -4
dtype: int64

In [8]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
obj2['a']

1

In [11]:
obj2[['b', 'c', 'd']]

b    2
c   -3
d   -4
dtype: int64

* 불리언 배열을 사용해서 값을 걸러내거나 산술 곱셈을 수행해도 index-값 연결은 유지된다.

In [12]:
obj2[obj2 > 0]

a    1
b    2
dtype: int64

In [13]:
np.exp(obj2)

a    2.718282
b    7.389056
c    0.049787
d    0.018316
dtype: float64

* Series를 이해하는 다른 방법은 고정 길이의 정렬된 사전형이라고 이해하는 것이다.

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2

False

* 파이썬의 dictionary 객체로부터 Series 객체를 생성할 수도 있다.

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000,}

In [18]:
obj3 = Series(sdata)

In [19]:
obj3

Ohio     35000
Texas    71000
dtype: int64

In [20]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [21]:
obj4 = Series(sdata, index=states)

In [22]:
obj4

California        NaN
Ohio          35000.0
Oregon            NaN
Texas         71000.0
dtype: float64

* 빈 값은 NaN으로 표시된다.
* pandas의 isnull과 notnull 함수는 누락된 데이터를 찾을 때 사용된다.

In [23]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon         True
Texas         False
dtype: bool

In [24]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon        False
Texas          True
dtype: bool

* isnull과 notnull은 Series의 인스턴스 메서드이기도 하다.

In [25]:
obj4.isnull()

California     True
Ohio          False
Oregon         True
Texas         False
dtype: bool

* 가장 중요한 Series의 기능은 다르게 색인된 데이터에 대한 산술연산이다.

In [26]:
obj3

Ohio     35000
Texas    71000
dtype: int64

In [27]:
obj4

California        NaN
Ohio          35000.0
Oregon            NaN
Texas         71000.0
dtype: float64

In [28]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon             NaN
Texas         142000.0
dtype: float64

* Series 객체와 Series의 index는 모두 name 속성이 있다.

In [29]:
obj4.name = 'population'

In [31]:
obj4.index.name = 'state'

In [32]:
obj4

state
California        NaN
Ohio          35000.0
Oregon            NaN
Texas         71000.0
Name: population, dtype: float64

* Series의 index는 대입을 통해 변경할 수 있다.

In [37]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan', 'Lee']

In [38]:
obj

Bob      1
Steve    2
Jeff     3
Ryan    -4
Lee     -5
dtype: int64

In [39]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan', 'Ryan']

* index값에 중복이 있어도 허용된다.

## DataFrame

* DataFrame 객체를 생성하는 가장 흔한 방법은 같은 길이의 리스트에 담긴 사전을 이용하거나 Numpy 배열을 이용하는 것이다.

In [40]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year':[2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [41]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

* 원하는 순서대로 컬럼을 지정할 수 있다.

In [42]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

* Series와 마찬가지로 data에 없는 값을 넘기면 NaN으로 설정된다.

In [43]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])

In [44]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [45]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

* DataFrame의 컬럼은 Series처럼 사전 형식의 표기법으로 접근하거나 속성 형식으로 접근할 수 있다.

In [46]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [47]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

* loc 같은 메서드를 이용하면 index를 이용하여 해당 row의 데이터에 접근할 수 있다.

In [50]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

* 컬럼의 값을 대입할 수 있다.

In [51]:
frame2['debt'] = 16.5

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [56]:
frame2.debt = np.arange(5)

In [57]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

* 리스트나 배열을 컬럼에 대입할 때는 대입하려는 값의 길이가 DataFrame의 크기와 같아야 한다.
* Series를 대입하면 DataFrame의 index에 따라 값이 대입되며 없는 index에는 값이 대입되지 않는다.

In [58]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [59]:
frame2['debt'] = val

In [60]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

* 없는 컬럼을 대입하면 새로운 컬럼이 생성된다.
* 파이썬 dictionary와 마찬가지로 del 예약어를 사용하여 컬럼을 삭제할 수 있다.

In [61]:
frame2['eastern'] = frame2.state == 'Ohio'

In [62]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [63]:
del frame2['eastern']

In [64]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

* DataFrame의 index를 이용하여 생성된 컬럼은 내부 데이터에 대한 view이며 복사가 이루어지지 않는다.
* 따라서 이렇게 얻은 Series 객체에 대한 변경은 실제 DataFrame에 반영된다.

* 중첩된 dictionary를 이용해서 데이터를 생성할 수도 있다.
* 바깥에 있는 dictionary의 키 값이 컬럼이 되고, 안에 있는 키는 row가 된다.

In [65]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001:1.7, 2002: 3.6}}

In [66]:
frame3 = DataFrame(pop)

In [67]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

* Numpy와 마찬가지로 결과 값의 순서를 뒤집을 수 있다.

In [68]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

* 중첩된 dictionary를 이용하여 DataFrame을 생성할 때 안쪽에 있는 dictionary의 키는 index가 된다.
* index를 직접 지정한다면 지정된 index로 DataFrame을 생성한다.
* index에 지정되지 않은 key는 무시된다.

In [70]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

* Series 객체를 담고 있는 dictionary 데이터도 같은 방식으로 취급된다.

In [71]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

In [72]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [73]:
frame3.index.name = 'year'

In [74]:
frame3.columns.name = 'state'

In [75]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

* Series와 유사하게 values 속성은 DataFrmae에 저장된 데이터를 2차원 배열로 반환한다.

In [76]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

## 색인 객체 index

* pandas의 index 객체는 표 형식의 데이터에서 각 로우와 컬럼에 대한 이름과 다른 메타데이터(축 이름 등)를 저장하는 객체다.
* Series나 DataFrame 객체를 생성할 때 사용되는 배열이나 혹은 다른 순차적인 이름은 내부적으로 index로 변환된다.

In [78]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [79]:
index = obj.index

In [80]:
index

Index(['a', 'b', 'c'], dtype='object')

In [81]:
index[1:]

Index(['b', 'c'], dtype='object')

* index 객체는 변경할 수 없다.

In [82]:
index = pd.Index(np.arange(3))

In [83]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [84]:
obj2.index is index

True

In [85]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [86]:
'Ohio' in frame3.columns

True

In [87]:
2003 in frame3.index

False

* index는 여러 가지 메서드와 속성을 가지고 있다.
    * append
    * diff
    * intersection
    * union
    * isin
    * delete
    * drop
    * insert
    * is_monotonic
    * is_unique
    * unique

## 재색인
* reindex: 새로운 index에 맞도록 객체를 새로 생성한다.

In [88]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [89]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

* 이 Series 객체에 대해 reindex를 호출하면 데이터를 새로운 index에 맞게 재배열하고, 없는 index 값이 있다면 NaN을 설정한다.

In [90]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [91]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [92]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

* fill_value를 이용하여 NaN 값을 채워넣을 수 있다.
* 시계열 같은 순차적인 데이터를 재색인할 때 값을 보간하거나 채워넣을 수 있다.
* method 옵션을 이용하여 ffill 매서드를 이요하여 앞의 값으로 누락된 값을 채워넣을 수 있다.

In [93]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

* ffill, pad 앞의 값으로 채워 넣는다.
* bfill, backfill 뒤의 값으로 채워 넣는다.

* DataFrame에 대한 reindex는 index, columns 둘 다 변경이 가능하다.

In [96]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [97]:
frame.reindex(index=['a', 'b', 'c', 'd'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [100]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill')

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

* row, columns을 모두 한 번에 재색인할 수 있지만 보간은 row에 대해서만 이루어진다.

In [101]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

## row, column 삭제하기

In [103]:
obj = Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])

In [104]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [105]:
new_obj = obj.drop('c')

In [106]:
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [107]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [108]:
obj.drop(['c', 'd'])

a    0
b    1
e    4
dtype: int32

* DaraFrame에서는 row, column 모두 삭제할 수 있다.

In [109]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [110]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [113]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

## 색인하기, 선택하기, 거르기

* Series의 색인은 Numpy 배열의 색인과 유사하게 동작한다.
* Series의 색인은 정수가 아니어도 된다는 점이 다르다.

In [114]:
obj = Series(np.arange(4), index=['a', 'b', 'c', 'd'])

In [115]:
obj['b']

1

In [116]:
obj[1]

1

In [117]:
obj[2:4]

c    2
d    3
dtype: int32

In [119]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: int32

In [120]:
obj[[1, 3]]

b    1
d    3
dtype: int32

In [121]:
obj[obj < 2]

a    0
b    1
dtype: int32

In [122]:
obj['b':'c']

b    1
c    2
dtype: int32

* 라벨 이름으로 슬라이싱하는 것은 시작점과 끝점을 포함한다는 점이 일반 파이썬의 슬라이싱과 다른 점이다.

* 슬라이싱으로 선택된 영역에 값을 대입하는 것도 가능하다.

In [123]:
obj['b':'c'] = 5

In [124]:
obj

a    0
b    5
c    5
d    3
dtype: int32

In [125]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [126]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [127]:
data[['two', 'three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [128]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [129]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

* 스칼라 비교를 통해 생성된 불리언 DataFrame을 사용해서 값을 선택할 수도 있다.

In [130]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [131]:
data[data < 5] = 0

In [132]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

* xs 메서드: 라벨 이름으로 단일 로우나 컬럼을 Series 형식으로 선택한다.
* icol, irow 메서드: 각각 정수 색인으로 단일 로우나 컬럼을 Series 형식으로 선택한다.
* get_value, set_value 메서드: 로우와 컬럼 이름으로 DataFrame의 값을 선택한다.

In [134]:
data.xs('Ohio')

one      0
two      0
three    0
four     0
Name: Ohio, dtype: int32

In [139]:
data.xs('two', axis=1)

Ohio         0
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

* icol(deprecate) -> iloc[:, i]

In [154]:
data.iloc[:, 0]

Ohio         0
Colorado     0
Utah         8
New York    12
Name: one, dtype: int32

In [156]:
data.iloc[:, [0, 1]]

          one  two
Ohio        0    0
Colorado    0    5
Utah        8    9
New York   12   13

* irow(deprecate) -> iloc[i]

In [151]:
data.iloc[0]

one      0
two      0
three    0
four     0
Name: Ohio, dtype: int32

In [153]:
data.iloc[[0, 1]]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7

* get_value(deprecate) -> at[], iat[]

In [159]:
data.at['Utah', 'one']

8

In [161]:
data.iat[2, 0]

8

In [162]:
data.at['Utah', 'one'] = 10

In [163]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah       10    9     10    11
New York   12   13     14    15

## 산술연산과 데이터 정렬

* 객체를 더할 때 짝이 맞지 않는 색인이 있다면 결과에 두 색인이 통합된다.

In [165]:
s1 = Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
s2 = Series([6, 7, 8, 9, 10], index=['a', 'c', 'e', 'f', 'g'])

In [166]:
s1

a    1
b    2
c    3
d    4
dtype: int64